practica01/indicaciones.tex
% Created 2018-09-10 lun 13:38
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish]{babel}
\usepackage{fancyvrb}
\author{Dr. Miguel Carrillo Barajas \\
Estefanía Prieto Larios \\
Mauricio Esquivel Reyes \\
}
\date{}
\title{Sesión de laboratorio 03 \\
Lógica Computacional \\
Universidad Nacional Autónoma de México}
\hypersetup{
 pdfauthor={Dr. Miguel Carrillo Barajas \\
Estefanía Prieto Larios \\
Mauricio Esquivel Reyes \\
},
 pdftitle={Sesión de laboratorio 03 \\
Lógica Computacional \\
Universidad Nacional Autónoma de México},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.2 (Org mode 9.1.14)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle
\section{Estructuras}
\label{sec:org3d4d614}
\subsection{Naturales}
\label{sec:org2740e15}
Consideremos la siguiente representación de los números naturales

\begin{verbatim}
data Natural = Cero | Suc Natural deriving (Eq, Show)
\end{verbatim}
\subsubsection{mayorQue :: Natural -> Natural -> Bool}
\label{sec:orgef08437}
Dados dos naturales nos dice si el primero es mayor que el segundo
Ejemlos:
\begin{itemize}
\item Main> mayorQue Cero (Suc Cero)
False
\item Main> mayorQue (Suc Cero) Cero
True
\end{itemize}
\subsubsection{menorQue :: Natural -> Natural -> Bool}
\label{sec:org0ea04b6}
Dados dos naturales nos dice si el primero es menor que el segundo
Ejemlos:
\begin{itemize}
\item Main> menorQue Cero (Suc Cero)
True
\item Main> menorQue (Suc Cero) Cero
False
\end{itemize}
\subsubsection{igual :: Natural -> Natural -> Bool}
\label{sec:org531da9b}
Dados dos naturales nos dice si son iguales
Ejemplos:
\begin{itemize}
\item Main> igual Cero (Suc Cero)
False
\item Main> igual (Suc Cero) (Suc Cero)
True
\end{itemize}
\subsection{Lista de naturales}
\label{sec:org83dcdc8}
Consideremos la siguiente definición de las listas de naturales.
\begin{verbatim}
data ListaDeNaturales = Nil | Cons Natural ListaDeNaturales
\end{verbatim}
\subsubsection{concate :: ListaDeNaturales -> ListaDeNaturales -> ListaDeNaturales}
\label{sec:org31a6a3d}
Dadas dos listas de naturales regresar la concatenación de ambas.
Ejemplos:
\begin{itemize}
\item $\backslash$*Main> concate (Cons (Suc Cero) Nil) (Cons Cero (Cons (Suc (Suc Cero)) Nil))
Cons (Suc Cero) (Cons Cero (Cons (Suc (Suc Cero)) Nil))
\item $\backslash$*Main> concate (Cons Cero (Cons (Suc (Suc Cero)) Nil)) (Cons (Suc Cero) Nil)
Cons Cero (Cons (Suc (Suc Cero)) (Cons (Suc Cero) Nil))
\end{itemize}
\subsubsection{reversa :: ListaDeNaturales -> ListaDeNaturales}
\label{sec:orga8ef633}
Dada una lista regresar la reversa de dicha lista
Ejemplos:
\begin{itemize}
\item $\backslash$*Main> reversa (Cons Cero (Cons (Suc (Suc Cero)) (Cons (Suc Cero) Nil))) 
Cons (Suc Cero) (Cons (Suc (Suc Cero)) (Cons Cero Nil))
\end{itemize}

\section{Lógica Proposicional}
\label{sec:org5aaca62}
Consideremos la siguiente representación de la lógica proposicional.
\begin{verbatim}
-- Tipo de dato indice
type Indice = Int

-- Tipo de dato fórmula
data PL = Top | Bot  | Var Indice
              | Oneg PL 
              | Oand PL PL | Oor PL PL 
              | Oimp PL PL deriving (Eq, Show)
\end{verbatim}
\subsection{Conjunciones}
\label{sec:org444082f}
\subsubsection{conj :: PL -> [PL]}
\label{sec:org8f7788e}
Dada una formula regresar una lista con las conjunciones de dicha formula
Ejemplo: 
\begin{itemize}
\item $\backslash$*Main> conj Oor (Oand (Var 1) Oneg \$ Var 2) (Oand Bot (Var 3))
[Oand (Var 1) Oneg \$ Var 2, Oand Bot (Var 3)]
\end{itemize}
\subsubsection{numConj :: PL -> Int}
\label{sec:org31745e1}
Dada una formula regresar el número de conjunciones que tiene dicha formula
Ejemplo:
\begin{itemize}
\item $\backslash$*Main> conj Oor (Oand (Var 1) Oneg \$ Var 2) (Oand Bot (Var 3))
2
\end{itemize}
\subsection{Formas normales}
\label{sec:org6750248}
\subsubsection{esClausula :: PL -> Bool}
\label{sec:org2a6c6ff}
Dada una formula nos indica si es una clausula
\subsubsection{esTermino :: PL -> Bool}
\label{sec:org22f6694}
Dada una formula nos indica si es un termino
\end{document}
